; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l25_p25_c25_g25)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 refugio10 refugio11 refugio12 refugio13 refugio14 refugio15 refugio16 refugio17 refugio18 refugio19 refugio20 refugio21 refugio22 refugio23 refugio24 refugio25 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 person10 person11 person12 person13 person14 person15 person16 person17 person18 person19 person20 person21 person22 person23 person24 person25 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 comida)
	(at-box box7 deposito)
	(box-has box7 comida)
	(at-box box8 deposito)
	(box-has box8 comida)
	(at-box box9 deposito)
	(box-has box9 comida)
	(at-box box10 deposito)
	(box-has box10 comida)
	(at-box box11 deposito)
	(box-has box11 comida)
	(at-box box12 deposito)
	(box-has box12 comida)
	(at-box box13 deposito)
	(box-has box13 comida)
	(at-box box14 deposito)
	(box-has box14 comida)
	(at-box box15 deposito)
	(box-has box15 medicina)
	(at-box box16 deposito)
	(box-has box16 medicina)
	(at-box box17 deposito)
	(box-has box17 medicina)
	(at-box box18 deposito)
	(box-has box18 medicina)
	(at-box box19 deposito)
	(box-has box19 medicina)
	(at-box box20 deposito)
	(box-has box20 medicina)
	(at-box box21 deposito)
	(box-has box21 medicina)
	(at-box box22 deposito)
	(box-has box22 medicina)
	(at-box box23 deposito)
	(box-has box23 medicina)
	(at-box box24 deposito)
	(box-has box24 medicina)
	(at-box box25 deposito)
	(box-has box25 medicina)
	(at-person person1 refugio4)
	(at-person person2 refugio21)
	(at-person person3 refugio18)
	(at-person person4 refugio19)
	(at-person person5 refugio1)
	(at-person person6 refugio4)
	(at-person person7 refugio24)
	(at-person person8 refugio2)
	(at-person person9 refugio21)
	(at-person person10 refugio5)
	(at-person person11 refugio9)
	(at-person person12 refugio23)
	(at-person person13 refugio16)
	(at-person person14 refugio10)
	(at-person person15 refugio13)
	(at-person person16 refugio23)
	(at-person person17 refugio14)
	(at-person person18 refugio4)
	(at-person person19 refugio1)
	(at-person person20 refugio10)
	(at-person person21 refugio24)
	(at-person person22 refugio4)
	(at-person person23 refugio10)
	(at-person person24 refugio22)
	(at-person person25 refugio18)
)

(:goal (and
	(person-has person2 comida)
	(person-has person2 medicina)
	(person-has person3 comida)
	(person-has person3 medicina)
	(person-has person6 medicina)
	(person-has person7 comida)
	(person-has person8 comida)
	(person-has person9 comida)
	(person-has person10 comida)
	(person-has person12 comida)
	(person-has person14 comida)
	(person-has person14 medicina)
	(person-has person15 comida)
	(person-has person15 medicina)
	(person-has person17 comida)
	(person-has person18 comida)
	(person-has person18 medicina)
	(person-has person21 comida)
	(person-has person21 medicina)
	(person-has person22 comida)
	(person-has person22 medicina)
	(person-has person23 medicina)
	(person-has person24 comida)
	(person-has person24 medicina)
	(person-has person25 medicina)
))
)

; plan
1. (pick box14 deposito dron1-der dron1)
   deleted: (at-box box14 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box14)
   goals met: 0 of 25
2. (pick box25 deposito dron1-izq dron1)
   deleted: (at-box box25 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box25)
   goals met: 0 of 25
3. (move deposito refugio2 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio2)
   goals met: 0 of 25
4. (leave box14 refugio2 dron1-der dron1 person8 comida)
   deleted: (carrying dron1 dron1-der box14) (box-has box14 comida)
   added: (at-box box14 refugio2) (free dron1-der) (person-has person8 comida)
   goals met: 1 of 25
5. (move refugio2 deposito dron1)
   deleted: (at-dron dron1 refugio2)
   added: (at-dron dron1 deposito)
   goals met: 1 of 25
6. (pick box13 deposito dron1-der dron1)
   deleted: (at-box box13 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box13)
   goals met: 1 of 25
7. (move deposito refugio21 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio21)
   goals met: 1 of 25
8. (move refugio21 refugio5 dron1)
   deleted: (at-dron dron1 refugio21)
   added: (at-dron dron1 refugio5)
   goals met: 1 of 25
9. (leave box13 refugio5 dron1-der dron1 person10 comida)
   deleted: (carrying dron1 dron1-der box13) (box-has box13 comida)
   added: (at-box box13 refugio5) (free dron1-der) (person-has person10 comida)
   goals met: 2 of 25
10. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 2 of 25
11. (pick box12 deposito dron1-der dron1)
   deleted: (at-box box12 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box12)
   goals met: 2 of 25
12. (move deposito refugio21 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio21)
   goals met: 2 of 25
13. (move refugio21 refugio23 dron1)
   deleted: (at-dron dron1 refugio21)
   added: (at-dron dron1 refugio23)
   goals met: 2 of 25
14. (leave box12 refugio23 dron1-der dron1 person12 comida)
   deleted: (carrying dron1 dron1-der box12) (box-has box12 comida)
   added: (at-box box12 refugio23) (free dron1-der) (person-has person12 comida)
   goals met: 3 of 25
15. (move refugio23 deposito dron1)
   deleted: (at-dron dron1 refugio23)
   added: (at-dron dron1 deposito)
   goals met: 3 of 25
16. (pick box11 deposito dron1-der dron1)
   deleted: (at-box box11 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box11)
   goals met: 3 of 25
17. (move deposito refugio21 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio21)
   goals met: 3 of 25
18. (move refugio21 refugio14 dron1)
   deleted: (at-dron dron1 refugio21)
   added: (at-dron dron1 refugio14)
   goals met: 3 of 25
19. (leave box11 refugio14 dron1-der dron1 person17 comida)
   deleted: (carrying dron1 dron1-der box11) (box-has box11 comida)
   added: (at-box box11 refugio14) (free dron1-der) (person-has person17 comida)
   goals met: 4 of 25
20. (move refugio14 deposito dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 deposito)
   goals met: 4 of 25
21. (pick box10 deposito dron1-der dron1)
   deleted: (at-box box10 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box10)
   goals met: 4 of 25
22. (move deposito refugio21 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio21)
   goals met: 4 of 25
23. (leave box10 refugio21 dron1-der dron1 person2 comida)
   deleted: (carrying dron1 dron1-der box10) (box-has box10 comida)
   added: (at-box box10 refugio21) (free dron1-der) (person-has person2 comida)
   goals met: 5 of 25
24. (move refugio21 deposito dron1)
   deleted: (at-dron dron1 refugio21)
   added: (at-dron dron1 deposito)
   goals met: 5 of 25
25. (pick box9 deposito dron1-der dron1)
   deleted: (at-box box9 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box9)
   goals met: 5 of 25
26. (move deposito refugio21 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio21)
   goals met: 5 of 25
27. (leave box25 refugio21 dron1-izq dron1 person2 medicina)
   deleted: (carrying dron1 dron1-izq box25) (box-has box25 medicina)
   added: (at-box box25 refugio21) (free dron1-izq) (person-has person2 medicina)
   goals met: 6 of 25
28. (move refugio21 deposito dron1)
   deleted: (at-dron dron1 refugio21)
   added: (at-dron dron1 deposito)
   goals met: 6 of 25
29. (pick box24 deposito dron1-izq dron1)
   deleted: (at-box box24 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box24)
   goals met: 6 of 25
30. (move deposito refugio21 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio21)
   goals met: 6 of 25
31. (leave box9 refugio21 dron1-der dron1 person9 comida)
   deleted: (carrying dron1 dron1-der box9) (box-has box9 comida)
   added: (at-box box9 refugio21) (free dron1-der) (person-has person9 comida)
   goals met: 7 of 25
32. (move refugio21 deposito dron1)
   deleted: (at-dron dron1 refugio21)
   added: (at-dron dron1 deposito)
   goals met: 7 of 25
33. (pick box8 deposito dron1-der dron1)
   deleted: (at-box box8 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box8)
   goals met: 7 of 25
34. (move deposito refugio13 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio13)
   goals met: 7 of 25
35. (leave box8 refugio13 dron1-der dron1 person15 comida)
   deleted: (carrying dron1 dron1-der box8) (box-has box8 comida)
   added: (at-box box8 refugio13) (free dron1-der) (person-has person15 comida)
   goals met: 8 of 25
36. (move refugio13 deposito dron1)
   deleted: (at-dron dron1 refugio13)
   added: (at-dron dron1 deposito)
   goals met: 8 of 25
37. (pick box7 deposito dron1-der dron1)
   deleted: (at-box box7 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box7)
   goals met: 8 of 25
38. (move deposito refugio13 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio13)
   goals met: 8 of 25
39. (leave box24 refugio13 dron1-izq dron1 person15 medicina)
   deleted: (carrying dron1 dron1-izq box24) (box-has box24 medicina)
   added: (at-box box24 refugio13) (free dron1-izq) (person-has person15 medicina)
   goals met: 9 of 25
40. (move refugio13 deposito dron1)
   deleted: (at-dron dron1 refugio13)
   added: (at-dron dron1 deposito)
   goals met: 9 of 25
41. (pick box23 deposito dron1-izq dron1)
   deleted: (at-box box23 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box23)
   goals met: 9 of 25
42. (move deposito refugio24 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio24)
   goals met: 9 of 25
43. (leave box7 refugio24 dron1-der dron1 person7 comida)
   deleted: (carrying dron1 dron1-der box7) (box-has box7 comida)
   added: (at-box box7 refugio24) (free dron1-der) (person-has person7 comida)
   goals met: 10 of 25
44. (move refugio24 deposito dron1)
   deleted: (at-dron dron1 refugio24)
   added: (at-dron dron1 deposito)
   goals met: 10 of 25
45. (pick box6 deposito dron1-der dron1)
   deleted: (at-box box6 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box6)
   goals met: 10 of 25
46. (move deposito refugio24 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio24)
   goals met: 10 of 25
47. (leave box6 refugio24 dron1-der dron1 person21 comida)
   deleted: (carrying dron1 dron1-der box6) (box-has box6 comida)
   added: (at-box box6 refugio24) (free dron1-der) (person-has person21 comida)
   goals met: 11 of 25
48. (move refugio24 deposito dron1)
   deleted: (at-dron dron1 refugio24)
   added: (at-dron dron1 deposito)
   goals met: 11 of 25
49. (pick box5 deposito dron1-der dron1)
   deleted: (at-box box5 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box5)
   goals met: 11 of 25
50. (move deposito refugio24 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio24)
   goals met: 11 of 25
51. (leave box23 refugio24 dron1-izq dron1 person21 medicina)
   deleted: (carrying dron1 dron1-izq box23) (box-has box23 medicina)
   added: (at-box box23 refugio24) (free dron1-izq) (person-has person21 medicina)
   goals met: 12 of 25
52. (move refugio24 deposito dron1)
   deleted: (at-dron dron1 refugio24)
   added: (at-dron dron1 deposito)
   goals met: 12 of 25
53. (pick box22 deposito dron1-izq dron1)
   deleted: (at-box box22 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box22)
   goals met: 12 of 25
54. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 12 of 25
55. (leave box22 refugio4 dron1-izq dron1 person6 medicina)
   deleted: (carrying dron1 dron1-izq box22) (box-has box22 medicina)
   added: (at-box box22 refugio4) (free dron1-izq) (person-has person6 medicina)
   goals met: 13 of 25
56. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 13 of 25
57. (pick box21 deposito dron1-izq dron1)
   deleted: (at-box box21 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box21)
   goals met: 13 of 25
58. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 13 of 25
59. (leave box5 refugio4 dron1-der dron1 person18 comida)
   deleted: (carrying dron1 dron1-der box5) (box-has box5 comida)
   added: (at-box box5 refugio4) (free dron1-der) (person-has person18 comida)
   goals met: 14 of 25
60. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 14 of 25
61. (pick box4 deposito dron1-der dron1)
   deleted: (at-box box4 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box4)
   goals met: 14 of 25
62. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 14 of 25
63. (leave box21 refugio4 dron1-izq dron1 person18 medicina)
   deleted: (carrying dron1 dron1-izq box21) (box-has box21 medicina)
   added: (at-box box21 refugio4) (free dron1-izq) (person-has person18 medicina)
   goals met: 15 of 25
64. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 15 of 25
65. (pick box20 deposito dron1-izq dron1)
   deleted: (at-box box20 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box20)
   goals met: 15 of 25
66. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 15 of 25
67. (leave box4 refugio4 dron1-der dron1 person22 comida)
   deleted: (carrying dron1 dron1-der box4) (box-has box4 comida)
   added: (at-box box4 refugio4) (free dron1-der) (person-has person22 comida)
   goals met: 16 of 25
68. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 16 of 25
69. (pick box3 deposito dron1-der dron1)
   deleted: (at-box box3 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box3)
   goals met: 16 of 25
70. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 16 of 25
71. (leave box20 refugio4 dron1-izq dron1 person22 medicina)
   deleted: (carrying dron1 dron1-izq box20) (box-has box20 medicina)
   added: (at-box box20 refugio4) (free dron1-izq) (person-has person22 medicina)
   goals met: 17 of 25
72. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 17 of 25
73. (pick box19 deposito dron1-izq dron1)
   deleted: (at-box box19 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box19)
   goals met: 17 of 25
74. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 17 of 25
75. (leave box3 refugio10 dron1-der dron1 person14 comida)
   deleted: (carrying dron1 dron1-der box3) (box-has box3 comida)
   added: (at-box box3 refugio10) (free dron1-der) (person-has person14 comida)
   goals met: 18 of 25
76. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 18 of 25
77. (pick box2 deposito dron1-der dron1)
   deleted: (at-box box2 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box2)
   goals met: 18 of 25
78. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 18 of 25
79. (leave box19 refugio10 dron1-izq dron1 person14 medicina)
   deleted: (carrying dron1 dron1-izq box19) (box-has box19 medicina)
   added: (at-box box19 refugio10) (free dron1-izq) (person-has person14 medicina)
   goals met: 19 of 25
80. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 19 of 25
81. (pick box18 deposito dron1-izq dron1)
   deleted: (at-box box18 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box18)
   goals met: 19 of 25
82. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 19 of 25
83. (leave box18 refugio10 dron1-izq dron1 person23 medicina)
   deleted: (carrying dron1 dron1-izq box18) (box-has box18 medicina)
   added: (at-box box18 refugio10) (free dron1-izq) (person-has person23 medicina)
   goals met: 20 of 25
84. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 20 of 25
85. (pick box17 deposito dron1-izq dron1)
   deleted: (at-box box17 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box17)
   goals met: 20 of 25
86. (move deposito refugio22 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio22)
   goals met: 20 of 25
87. (leave box2 refugio22 dron1-der dron1 person24 comida)
   deleted: (carrying dron1 dron1-der box2) (box-has box2 comida)
   added: (at-box box2 refugio22) (free dron1-der) (person-has person24 comida)
   goals met: 21 of 25
88. (move refugio22 deposito dron1)
   deleted: (at-dron dron1 refugio22)
   added: (at-dron dron1 deposito)
   goals met: 21 of 25
89. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 21 of 25
90. (move deposito refugio22 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio22)
   goals met: 21 of 25
91. (move refugio22 refugio18 dron1)
   deleted: (at-dron dron1 refugio22)
   added: (at-dron dron1 refugio18)
   goals met: 21 of 25
92. (leave box1 refugio18 dron1-der dron1 person3 comida)
   deleted: (carrying dron1 dron1-der box1) (box-has box1 comida)
   added: (at-box box1 refugio18) (free dron1-der) (person-has person3 comida)
   goals met: 22 of 25
93. (move refugio18 refugio22 dron1)
   deleted: (at-dron dron1 refugio18)
   added: (at-dron dron1 refugio22)
   goals met: 22 of 25
94. (leave box17 refugio22 dron1-izq dron1 person24 medicina)
   deleted: (carrying dron1 dron1-izq box17) (box-has box17 medicina)
   added: (at-box box17 refugio22) (free dron1-izq) (person-has person24 medicina)
   goals met: 23 of 25
95. (move refugio22 deposito dron1)
   deleted: (at-dron dron1 refugio22)
   added: (at-dron dron1 deposito)
   goals met: 23 of 25
96. (pick box16 deposito dron1-der dron1)
   deleted: (at-box box16 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box16)
   goals met: 23 of 25
97. (move deposito refugio18 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio18)
   goals met: 23 of 25
98. (leave box16 refugio18 dron1-der dron1 person3 medicina)
   deleted: (carrying dron1 dron1-der box16) (box-has box16 medicina)
   added: (at-box box16 refugio18) (free dron1-der) (person-has person3 medicina)
   goals met: 24 of 25
99. (move refugio18 deposito dron1)
   deleted: (at-dron dron1 refugio18)
   added: (at-dron dron1 deposito)
   goals met: 24 of 25
100. (pick box15 deposito dron1-der dron1)
   deleted: (at-box box15 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box15)
   goals met: 24 of 25
101. (move deposito refugio18 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio18)
   goals met: 24 of 25
102. (leave box15 refugio18 dron1-der dron1 person25 medicina)
   deleted: (carrying dron1 dron1-der box15) (box-has box15 medicina)
   added: (at-box box15 refugio18) (free dron1-der) (person-has person25 medicina)
   goals met: 25 of 25
